#include "ImageSpaceAdapters.h"

#include <any>
#include <regex>

#include "ConfigUtils.h"

namespace RE
{
	class __declspec(novtable) NiInterpolator : public NiObject
	{
	public:
		static constexpr auto RTTI{ RTTI::NiInterpolator };
		static constexpr auto VTABLE{ VTABLE::NiInterpolator };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiInterpolator };

		NiInterpolator() : lastTime(-FLT_MAX), pad14(0)
		{
			stl::emplace_vtable(this);
			refCount = 0;
		}

		virtual ~NiInterpolator() = default;

		float lastTime;       // 10
		std::uint32_t pad14;  // 14
	};
	static_assert(sizeof(NiInterpolator) == 0x18);

	class __declspec(novtable) NiKeyBasedInterpolator : public NiInterpolator
	{
	public:
		static constexpr auto RTTI{ RTTI::NiKeyBasedInterpolator };
		static constexpr auto VTABLE{ VTABLE::NiKeyBasedInterpolator };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiKeyBasedInterpolator };
	};
	static_assert(sizeof(NiKeyBasedInterpolator) == 0x18);

	class __declspec(novtable) NiFloatData : public NiObject
	{
	public:
		static constexpr auto RTTI{ RTTI::NiFloatData };
		static constexpr auto VTABLE{ VTABLE::NiFloatData };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiFloatData };

		NiFloatData() : numKeys(0), pad14(0), data(nullptr), type(0), keySize(0), pad25(0), pad26(0)
		{ 
			stl::emplace_vtable(this); 
			refCount = 0;
		}

		virtual ~NiFloatData() = default;

		struct Data
		{
			float time;   // 0
			float value;  // 4
		};

		// members
		std::uint32_t numKeys;  // 10
		std::uint32_t pad14;    // 14
		Data* data;             // 18
		std::uint32_t type;     // 20
		std::uint8_t keySize;   // 24
		std::uint8_t pad25;     // 25
		std::uint16_t pad26;    // 26
	};
	static_assert(sizeof(NiFloatData) == 0x28);

	class __declspec(novtable) NiColorData : public NiObject
	{
	public:
		static constexpr auto RTTI{ RTTI::NiColorData };
		static constexpr auto VTABLE{ VTABLE::NiColorData };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiColorData };

		NiColorData() : numKeys(0), pad14(0), data(nullptr), type(0), keySize(0), pad25(0), pad26(0)
		{
			stl::emplace_vtable(this);
			refCount = 0;
		}

		virtual ~NiColorData() = default;

		struct Data
		{
			float time;			// 0
			NiColorA color;		// 4
		};

		// members
		std::uint32_t numKeys;  // 10
		std::uint32_t pad14;    // 14
		Data* data;				// 18
		std::uint32_t type;     // 20
		std::uint8_t keySize;   // 24
		std::uint8_t pad25;     // 25
		std::uint16_t pad26;    // 26
	};
	static_assert(sizeof(NiColorData) == 0x28);

	class __declspec(novtable) NiFloatInterpolator : public NiKeyBasedInterpolator
	{
	public:
		static constexpr auto RTTI{ RTTI::NiFloatInterpolator };
		static constexpr auto VTABLE{ VTABLE::NiFloatInterpolator };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiFloatInterpolator };

		NiFloatInterpolator() : floatValue(-FLT_MAX), pad1C(0), floatData(nullptr), lastIndex(0), pad2C(0)
		{
			stl::emplace_vtable(this);
		}

		virtual ~NiFloatInterpolator() = default;

		// members
		float floatValue;                  // 18
		std::uint32_t pad1C;               // 1C
		NiPointer<NiFloatData> floatData;  // 20
		std::uint32_t lastIndex;           // 28
		std::uint32_t pad2C;               // 2C
	};
	static_assert(sizeof(NiFloatInterpolator) == 0x30);

	class __declspec(novtable) NiColorInterpolator : public NiKeyBasedInterpolator
	{
	public:
		static constexpr auto RTTI{ RTTI::NiColorInterpolator };
		static constexpr auto VTABLE{ VTABLE::NiColorInterpolator };
		static constexpr auto Ni_RTTI{ Ni_RTTI::NiColorInterpolator };

		NiColorInterpolator() : colorValue{ -FLT_MAX, -FLT_MAX, -FLT_MAX, -FLT_MAX }, colorData(nullptr), lastIndex(0), pad34(0)
		{
			stl::emplace_vtable(this);
		}

		virtual ~NiColorInterpolator() = default;

		// members
		NiColorA colorValue;               // 18
		NiPointer<NiColorData> colorData;  // 28
		std::uint32_t lastIndex;           // 30
		std::uint32_t pad34;               // 34
	};
	static_assert(sizeof(NiColorInterpolator) == 0x38);
}

namespace ImageSpaceAdapters
{
	constexpr std::string_view TypeName = "ImageSpaceAdapter";

	enum class FilterType
	{
		kFormID
	};

	std::string_view FilterTypeToString(FilterType a_value)
	{
		switch (a_value) {
		case FilterType::kFormID:
			return "FilterByFormID";
		default:
			return std::string_view{};
		}
	}

	enum class ElementType
	{
		kAnimatable,
		kDuration,
		kBlurRadius,
		kDoubleVisionStrength,
		kTintColor,
		kFadeColor,
		kRadialBlurUseTarget,
		kRadialBlurCenterX,
		kRadialBlurCenterY,
		kRadialBlurStrength,
		kRadialBlurRampUp,
		kRadialBlurRampDown,
		kRadialBlurStart,
		kRadialBlurDownStart,
		kDepthOfFieldUseTarget,
		kDepthOfFieldStrength,
		kDepthOfFieldDistance,
		kDepthOfFieldRange,
		kDepthOfFieldVignetteRadius,
		kDepthOfFieldVignetteStrength,
		kMotionBlurStrength,
		kHDREyeAdaptSpeedMult,
		kHDREyeAdaptSpeedAdd,
		kHDRBloomBlurRadiusMult,
